jeremysalwen/Mowgli/stm32/ros_usbnode/src/drivemotor.c
        /* todo check for timeout */

        break;

    case RX_CRC_ERROR:
    case RX_INVALID_ERROR:
    case RX_TIMEOUT_ERROR:
    default:
        /* inform for error */
        break;
    }
}

/// @brief Decode received drive motor messages
/// @param
void DRIVEMOTOR_App_Rx(void)
{
    if (drivemotors_eRxFlag == RX_VALID)
    {
        /* decode */
        uint8_t direction = drivemotor_psReceivedData.u8_direction;
        // we need to adjust for direction (+/-) !
        if ((direction & 0xc0) == 0xc0)
        {
            left_direction = 1;
        }
        else if ((direction & 0x80) == 0x80)
        {
            left_direction = -1;
        }
        else
        {
            left_direction = 0;
        }
        if ((direction & 0x30) == 0x30)
        {
            right_direction = 1;
        }
        else if ((direction & 0x20) == 0x20)
        {
            right_direction = -1;
        }
        else
        {
            right_direction = 0;
        }

        left_encoder_val = drivemotor_psReceivedData.u16_left_ticks;
        right_encoder_val = drivemotor_psReceivedData.u16_right_ticks;

        // power consumption
        left_power = drivemotor_psReceivedData.u8_left_power;
        right_power = drivemotor_psReceivedData.u8_right_power;

        /*
         * Accumulate distance ticks robustly.
         *
         * The drive controller reports a per-wheel counter (u16_*_ticks) that
         * rises monotonically within a motion segment and snaps back toward 0 on
         * a direction/stop transition - with up to one controller frame of
         * latency relative to the direction it reports. The old code tried to
         * PREDICT that reset from direction/speed edges and pre-zero prev_*; that
         * prediction raced the controller's reset latency, so on transitions it
         * scored the pre-reset count as a phantom jump (e.g. raw 10->11->1 became
         * +11,+10). Those are the "implausible wheel ticks" the ROS layer filters
         * with vx>0.6.
         *
         * Instead, detect the reset DIRECTLY from the counter: a normal frame
         * increases it (add the difference); a decrease means it reset (the new
         * segment's progress so far is just the new value). Bound the result to
         * what is kinematically possible so no stale/glitch value can leak in.
         */
        left_wheel_speed_val = left_direction * drivemotor_psReceivedData.u8_left_speed;
        int32_t l_s32LeftDelta = (int32_t)left_encoder_val - (int32_t)prev_left_encoder_val;
        uint32_t l_u32LeftInc =
            (left_direction == 0) ? 0u                                   /* not driving */
          : (l_s32LeftDelta >= 0) ? (uint32_t)l_s32LeftDelta             /* increment within a segment - the counter is
                                                                          * cumulative & CRC-checked, so this is real even
                                                                          * if a delayed read spans several frames: add it */
          : ((uint32_t)left_encoder_val <= DRIVEMOTOR_MAX_TICKS_PER_FRAME)
                                  ? (uint32_t)left_encoder_val           /* counter reset -> new-segment progress so far */
                                  : 0u;                                  /* "reset" to an implausibly large value is not a
                                                                          * clean reset -> drop (fail safe) */
        left_encoder_ticks += l_u32LeftInc;

        right_wheel_speed_val = right_direction * drivemotor_psReceivedData.u8_right_speed;
        int32_t l_s32RightDelta = (int32_t)right_encoder_val - (int32_t)prev_right_encoder_val;
        uint32_t l_u32RightInc =
            (right_direction == 0) ? 0u
          : (l_s32RightDelta >= 0) ? (uint32_t)l_s32RightDelta
          : ((uint32_t)right_encoder_val <= DRIVEMOTOR_MAX_TICKS_PER_FRAME)
                                   ? (uint32_t)right_encoder_val
                                   : 0u;
        right_encoder_ticks += l_u32RightInc;

#ifdef DRIVEMOTOR_TICK_REPORT
        /*
         * CSV telemetry for hardware evidence captures.
         *
         * old_* reproduces the legacy accumulator from this file before the
         * reset-race fix:
         *   if direction/speed edge is predicted, pretend prev raw counter = 0;
         *   then add abs(direction * (raw - predicted_prev)).
         *
         * fixed_* is the increment actually accumulated above from the same raw
         * controller frame. This lets one capture show the controller's real
         * report and both firmware interpretations side by side.
         */
        {
            static uint8_t l_u8ReportHeaderPrinted = 0;
            static uint32_t l_u32ReportSeq = 0;
            static uint32_t l_u32ReportStartMs = 0;
            static uint32_t l_u32OldLeftTotal = 0;
            static uint32_t l_u32OldRightTotal = 0;

            if (l_u32ReportStartMs == 0)
            {
                l_u32ReportStartMs = HAL_GetTick();
            }

            int8_t l_s8CmdLeftDir = (left_speed_req == 0) ? 0 : (left_dir_req ? 1 : -1);
            int8_t l_s8CmdRightDir = (right_speed_req == 0) ? 0 : (right_dir_req ? 1 : -1);

            int32_t l_s32OldLeftPrev = (int32_t)prev_left_encoder_val;
            if (left_direction == 0 ||
                (left_direction != prev_left_direction) ||
                (prev_left_wheel_speed_val == 0 && left_wheel_speed_val != 0))
            {
                l_s32OldLeftPrev = 0;
            }
            uint32_t l_u32OldLeftInc =
                (uint32_t)abs(left_direction * ((int32_t)left_encoder_val - l_s32OldLeftPrev));

            int32_t l_s32OldRightPrev = (int32_t)prev_right_encoder_val;
            if (right_direction == 0 ||
                (right_direction != prev_right_direction) ||
                (prev_right_wheel_speed_val == 0 && right_wheel_speed_val != 0))
            {
                l_s32OldRightPrev = 0;
            }
            uint32_t l_u32OldRightInc =
                (uint32_t)abs(right_direction * ((int32_t)right_encoder_val - l_s32OldRightPrev));

            l_u32OldLeftTotal += l_u32OldLeftInc;
            l_u32OldRightTotal += l_u32OldRightInc;

