jeremysalwen/Mowgli/stm32/ros_usbnode/src/drivemotor.c
            if (!l_u8ReportHeaderPrinted)
            {
                debug_printf("TICKCSV_HEADER,v2,cmd,reported,raw,legacy,fixed\r\n");
                l_u8ReportHeaderPrinted = 1;
            }

            debug_printf("TICKCSV,%lu,%lu,%lu,%d,%u,%d,%u,%d,%u,%u,%u,%ld,%lu,%lu,%lu,%lu,%d,%u,%u,%u,%ld,%lu,%lu,%lu,%lu\r\n",
                         (unsigned long)l_u32ReportSeq++,
                         (unsigned long)(HAL_GetTick() - l_u32ReportStartMs),
                         (unsigned long)DRIVEMOTOR_MAX_TICKS_PER_FRAME,
                         l_s8CmdLeftDir,
                         left_speed_req,
                         l_s8CmdRightDir,
                         right_speed_req,
                         left_direction,
                         drivemotor_psReceivedData.u8_left_speed,
                         left_encoder_val,
                         prev_left_encoder_val,
                         (long)l_s32LeftDelta,
                         (unsigned long)l_u32OldLeftInc,
                         (unsigned long)l_u32LeftInc,
                         (unsigned long)l_u32OldLeftTotal,
                         (unsigned long)left_encoder_ticks,
                         right_direction,
                         drivemotor_psReceivedData.u8_right_speed,
                         right_encoder_val,
                         prev_right_encoder_val,
                         (long)l_s32RightDelta,
                         (unsigned long)l_u32OldRightInc,
                         (unsigned long)l_u32RightInc,
                         (unsigned long)l_u32OldRightTotal,
                         (unsigned long)right_encoder_ticks);
        }
#endif

#ifdef DRIVEMOTOR_TICK_DEBUG
        /* Log per-frame encoder telemetry. The macro value is the per-side
         * increment threshold for logging; =0 logs every active/reset frame.
         * raw = signed counter delta (negative => a controller reset),
         * inc = ticks actually accumulated this frame. */
        if (l_u32LeftInc > (DRIVEMOTOR_TICK_DEBUG) || l_u32RightInc > (DRIVEMOTOR_TICK_DEBUG) ||
            l_s32LeftDelta < 0 || l_s32RightDelta < 0 ||
            (uint32_t)abs(l_s32LeftDelta) > DRIVEMOTOR_MAX_TICKS_PER_FRAME ||
            (uint32_t)abs(l_s32RightDelta) > DRIVEMOTOR_MAX_TICKS_PER_FRAME)
        {
            debug_printf("TICK L[d=%d s=%3u v=%5u p=%5u raw=%+ld inc=%lu]=%lu  R[d=%d s=%3u v=%5u p=%5u raw=%+ld inc=%lu]=%lu%s\r\n",
                         left_direction, drivemotor_psReceivedData.u8_left_speed, left_encoder_val, prev_left_encoder_val,
                         (long)l_s32LeftDelta, (unsigned long)l_u32LeftInc, (unsigned long)left_encoder_ticks,
                         right_direction, drivemotor_psReceivedData.u8_right_speed, right_encoder_val, prev_right_encoder_val,
                         (long)l_s32RightDelta, (unsigned long)l_u32RightInc, (unsigned long)right_encoder_ticks,
                         /* flag frames where the RAW counter delta exceeds the kinematic limit -
                          * i.e. exactly where the old accumulator would have injected a spike,
                          * now neutralised (inc above stays small/0). */
                         ((uint32_t)abs(l_s32LeftDelta) > DRIVEMOTOR_MAX_TICKS_PER_FRAME ||
                          (uint32_t)abs(l_s32RightDelta) > DRIVEMOTOR_MAX_TICKS_PER_FRAME) ? "  <<< would-spike (fixed)" : "");
        }
#endif

        prev_left_encoder_val = left_encoder_val;
        prev_left_wheel_speed_val = left_wheel_speed_val;
        prev_left_direction = left_direction;
        prev_right_encoder_val = right_encoder_val;
        prev_right_wheel_speed_val = right_wheel_speed_val;
        prev_right_direction = right_direction;

        wheelTicks_handler(left_direction, right_direction, left_encoder_ticks, right_encoder_ticks, left_wheel_speed_val, right_wheel_speed_val);

        drivemotors_eRxFlag = RX_WAIT; // ready for next message
    }
}

/// @brief Set drive motor speeds
/// @param left_speed left motor speed byte
/// @param right_speed right motor speed byte
/// @param left_dir left motor direction bit
/// @param right_dir  left motor direction bit
void DRIVEMOTOR_SetSpeed(uint8_t left_speed, uint8_t right_speed, uint8_t left_dir, uint8_t right_dir)
{
    left_speed_req = left_speed;
    right_speed_req = right_speed;
    if(left_speed_req == 0 && right_speed_req ==  0)
    {
        left_dir_req = 0;
        right_dir_req = 0;
    }
    else
    {
        left_dir_req = left_dir;
        right_dir_req = right_dir;
    }
}

/// @brief drive motor receive interrupt handler
/// @param
void DRIVEMOTOR_ReceiveIT(void)
{
    /* decode the frame */
    if (memcmp(drivemotor_pcu8Preamble, (uint8_t *)&drivemotor_psReceivedData, 5) == 0)
    {
        uint8_t l_u8crc = crcCalc((uint8_t *)&drivemotor_psReceivedData, DRIVEMOTOR_LENGTH_RECEIVED_MSG - 1);
        if (drivemotor_psReceivedData.u8_CRC == l_u8crc)
        {
            drivemotors_eRxFlag = RX_VALID;
        }
        else
        {
            drivemotors_eRxFlag = RX_CRC_ERROR;
        }
    }
    else
    {
        drivemotors_eRxFlag = RX_INVALID_ERROR;
    }
}

/******************************************************************************
 *  Private Functions
 *******************************************************************************/

__STATIC_INLINE void drivemotor_prepareMsg(uint8_t left_speed, uint8_t right_speed, uint8_t left_dir, uint8_t right_dir)
{

    uint8_t direction = 0x0;

    // calc direction bits
    if (right_dir == 1)
    {
        direction |= (0x20 + 0x10);
    }
    else
    {
        direction |= 0x20;
    }
    if (left_dir == 1)
    {
        direction |= (0x40 + 0x80);
    }
    else
    {
        direction |= 0x80;
    }

    drivemotor_pu8RqstMessage[0] = 0x55;
    drivemotor_pu8RqstMessage[1] = 0xaa;
    drivemotor_pu8RqstMessage[2] = 0x08;
    drivemotor_pu8RqstMessage[3] = 0x10;
    drivemotor_pu8RqstMessage[4] = 0x80;
    drivemotor_pu8RqstMessage[5] = direction;
    drivemotor_pu8RqstMessage[6] = left_speed;
    drivemotor_pu8RqstMessage[7] = right_speed;
    drivemotor_pu8RqstMessage[9] = 0;
    drivemotor_pu8RqstMessage[8] = 0;
    drivemotor_pu8RqstMessage[10] = 0;
    drivemotor_pu8RqstMessage[11] = crcCalc(drivemotor_pu8RqstMessage, DRIVEMOTOR_LENGTH_RQST_MSG - 1);
}
